// ->全体
//  1、http://video.zhufengpeixun.cn/kecheng/detail_1029018
//   第三章 第三节 课件5
//      prepend
//      insertAfter
//
//  2、补课(时间另行通知)
//   ->第三章 第三节 课件12  [选项卡插件化]
//
//   ->瀑布流(https://huaban.com/search/?q=%E5%90%B4%E4%BA%AC)
//
//  3、考试
//   -> 周六晚上 多张图片懒加载 (周末)
//   -> 表格排序没过的，周二晚上补考 (全日制)
//   -> 多张图片懒加载，周四晚上考试 (全日制)
//
// ->周末班
//   -> 预习
//    全日制轮播图：左右的
//    周末轮播图：渐隐渐现
//    第四章：第五节和第六节统一是五六周扩展的，JQ轮播班周末班不讲
//    第四章：第四节可以先不预习,JQ so easy!
//    争取把第四周第一节所有的都看完了
//
// ->全日制
//   -> 复习
//    周二早上来了，DOM库的考察
//    周二来了，头脑风暴例会，REPLACE正则实战

// 思考题:
// 1、时间字符串格式化
// var str = '2017-8-9 16:43:5';
// //->把这个字符串可以变为 'xxxx年xx月xx日 xx时xx分xx秒' / 'xx-xx xx:xx 08-09 16:43' ... 变为一切你想需要的格式
//
// 2、URL参数格式化
// var url = 'http://www.zhufengpeixun.com/index.html?name=zxt&age=28&sex=1&type=0';
// //->问号以后的都是`URL问号传参值`，接下里我们要把问号后面的信息拆解成为对象的键值对
// //->{name:'zxt',age:28,sex:1,type:0}
//
// 3、回到顶部案例优化
